In [3]:
import numpy as np
import pandas as pd

In [4]:
adult = pd.read_csv('adult Data Set.csv')
adult

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,Salary_range
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [9]:
adult.isna().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
Salary_range      0
dtype: int64

##### 1) Shape of dataset

In [5]:
adult.shape

(32561, 15)

##### 2) Print column names

In [6]:
adult.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'Salary_range'],
      dtype='object')

##### 3) How many men and women (sexÂ feature) are represented in this dataset?

In [11]:
adult.sex.value_counts()

 Male      21790
 Female    10771
Name: sex, dtype: int64

#####  4) What is the average age (ageÂ feature) of women?

In [33]:
adult[adult['sex'] == " Female"]["age"].mean()

36.85823043357163

#### 5) What is the percentage of German citizens (native-countryÂ feature)?

In [34]:
germany=adult[adult['native-country'] == " Germany"]["native-country"].count()  #count german citizens
total=adult["native-country"].count()  #count total citizens
percentage=(germany/total)*100    #find percentage
percentage #print percentage

0.42074874850281013

In [47]:
percentage=float((adult["native-country"] == " Germany").sum()) / adult.shape[0]*100
percentage

0.42074874850281013

#### 6) What are the mean and standard deviation of age for those who earn more than 50K per year (salaryÂ feature) and those who earn less than 50K per year?

In [55]:
#whose value is less than 50K
print("mean:",adult[adult['Salary_range']==" <=50K"]["age"].mean())
print("standard deviation:",adult[adult['Salary_range']==" <=50K"]["age"].std())

mean: 36.78373786407767
standard deviation: 14.020088490824813

In [57]:
#whose value is greater than 50K
print("mean:",adult[adult['Salary_range']==" >50K"]["age"].mean())
print("standard deviation :",adult[adult['Salary_range']==" >50K"]["age"].std())

mean: 44.24984058155847
standard deviation : 10.51902771985177

In [61]:
adult.groupby("Salary_range")['age'].describe()

                count       mean        std   min   25%   50%   75%   max
Salary_range
 <=50K        24720.0  36.783738  14.020088  17.0  25.0  34.0  46.0  90.0
 >50K          7841.0  44.249841  10.519028  19.0  36.0  44.0  51.0  90.0

##### 7.Is it true that people who earn more than 50K have at least high school education? (education â€“ Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters or Doctorate feature)

In [64]:
adult[adult["Salary_range"] == " >50K"]["education"].unique()  # No

array([' HS-grad', ' Masters', ' Bachelors', ' Some-college',
       ' Assoc-voc', ' Doctorate', ' Prof-school', ' Assoc-acdm',
       ' 7th-8th', ' 12th', ' 10th', ' 11th', ' 9th', ' 5th-6th',
       ' 1st-4th'], dtype=object)

In [69]:
array=[ "11th", "9th", "7th-8th", "12th","1st-4th", "10th",  "5th-6th", "Preschool"]
adult.loc[adult['Salary_range']==" >50K"]["education"].isin(array).all()

False

In [ ]:
# array=[ "11th", "9th", "7th-8th", "12th","1st-4th", "10th",  "5th-6th", "Preschool"]
# ~data.loc[data['salary']==">50K"]["education"].isin(array).all()

#### 8) Display age statistics for each race (raceÂ feature) and each gender (sexÂ feature). UseÂ groupby()Â andÂ describe(). Find the maximum age of men ofÂ Amer-Indian-EskimoÂ race.

In [77]:
adult.groupby(['race','sex'])['age'].describe()

                               count       mean        std   min   25%   50%  \
race                sex
 Amer-Indian-Eskimo  Female    119.0  37.117647  13.114991  17.0  27.0  36.0
                     Male      192.0  37.208333  12.049563  17.0  28.0  35.0
 Asian-Pac-Islander  Female    346.0  35.089595  12.300845  17.0  25.0  33.0
                     Male      693.0  39.073593  12.883944  18.0  29.0  37.0
 Black               Female   1555.0  37.854019  12.637197  17.0  28.0  37.0
                     Male     1569.0  37.682600  12.882612  17.0  27.0  36.0
 Other               Female    109.0  31.678899  11.631599  17.0  23.0  29.0
                     Male      162.0  34.654321  11.355531  17.0  26.0  32.0
 White               Female   8642.0  36.811618  14.329093  17.0  25.0  35.0
                     Male    19174.0  39.652498  13.436029  17.0  29.0  38.0

                               75%   max
race                sex
 Amer-Indian-Eskimo  Female  46.00  80.0
                     Male    45.00  82.0
 Asian-Pac-Islander  Female  43.75  75.0
                     Male    46.00  90.0
 Black               Female  46.00  90.0
                     Male    46.00  90.0
 Other               Female  39.00  74.0
                     Male    42.00  77.0
 White               Female  46.00  90.0
                     Male    49.00  90.0

the maximum age of men of Amer-Indian-Eskimo race is 82

#### 9)  Among whom is the proportion of those who earn a lot (>50K) greater: married or single men (marital-statusÂ feature)? Consider as married those who have aÂ marital-statusÂ starting withÂ MarriedÂ (Married-civ-spouse, Married-spouse-absent or Married-AF-spouse), the rest are considered bachelors

In [121]:
# married men
adult[(adult["sex"] == " Male")
     & (adult["marital-status"].str.startswith(" Married"))
     ]["Salary_range"].value_counts()

 <=50K    7576
 >50K     5965
Name: Salary_range, dtype: int64

In [120]:
# bachelors
adult[(adult["sex"] == " Male")
     & ~(adult["marital-status"].str.startswith(" Married"))
     ]["Salary_range"].value_counts()

 <=50K    7552
 >50K      697
Name: Salary_range, dtype: int64

In [118]:
#another method for not married
adult.loc[(adult['sex'] == ' Male') &
     (adult['marital-status'].isin([' Never-married', 
                                   ' Separated', 
                                   ' Divorced',
                                   ' Widowed'])), 'Salary_range'].value_counts()

 <=50K    7552
 >50K      697
Name: Salary_range, dtype: int64

In [117]:
adult['marital-status'].value_counts()

 Married-civ-spouse       14976
 Never-married            10683
 Divorced                  4443
 Separated                 1025
 Widowed                    993
 Married-spouse-absent      418
 Married-AF-spouse           23
Name: marital-status, dtype: int64

it is good to be married :-)

#### 10)  What is the maximum number of hours a person works per week (hours-per-weekÂ feature)? How many people work such a number of hours, and what is the percentage of those who earn a lot (>50K) among them?

In [147]:
#hours-per-week
max_load = adult["hours-per-week"].max()
print("Max time :- ",(max_time))

Max time :-  99

In [152]:
num_people_work= data[data["hours-per-week"] == max_load].shape[0]
print("Total number of workers:- ",(num_people_work))

Total number of workers:-  85

In [166]:
#or
a=len(adult[adult["hours-per-week"]==adult["hours-per-week"].max()])
print(a)

85

In [162]:
p_1= (float(data[(data["hours-per-week"] == max_load) & 
               (data["Salary_range"] == " >50K")].shape[0])/ num_people_work)
print("Percentage of rich:-",format(round(100 * p_1)))

Percentage of rich:- 29

In [172]:
#or
maxsalary=(data[data["hours-per-week"]==data["hours-per-week"].max()]["Salary_range"]==" >50K").value_counts()
percentage=((maxsalary[True])/num_people_work)*100
print("percentage: ",percentage,"%")

percentage:  29.411764705882355 %

In [ ]:
# print(no_of_people,"people work",data["hours-per-week"].max(),"hours")
# maxhours_maxsalary=(data[data["hours-per-week"]==data["hours-per-week"].max()]["salary"]==">50K").value_counts()
# percentage=((maxhours_maxsalary[True])/no_of_people)*100
# print("percentage: ",percentage)

#### 11) Count the average time of work (hours-per-week) for those who earn a little and a lot (salary) for each country (native-country). What will these be for Japan?

In [5]:
adult.groupby(["native-country"]==' Japan','Salary_range')['hours-per-week'].mean()

ValueError: No axis named Salary_range for object type DataFrame

In [8]:
pd.crosstab(
    adult["native-country"],
    adult["Salary_range"],
    values=adult["hours-per-week"],
    aggfunc=np.mean,
).T

native-country,?,Cambodia,Canada,China,Columbia,Cuba,Dominican-Republic,Ecuador,El-Salvador,England,...,Portugal,Puerto-Rico,Scotland,South,Taiwan,Thailand,Trinadad&Tobago,United-States,Vietnam,Yugoslavia
Salary_range,,,,,,,,,,,,,,,,,,,,,
<=50K,40.164760,41.416667,37.914634,37.381818,38.684211,37.985714,42.338235,38.041667,36.030928,40.483333,...,41.939394,38.470588,39.444444,40.15625,33.774194,42.866667,37.058824,38.799127,37.193548,41.6
>50K,45.547945,40.000000,45.641026,38.900000,50.000000,42.440000,47.000000,48.750000,45.000000,44.533333,...,41.500000,39.416667,46.666667,51.43750,46.800000,58.333333,40.000000,45.505369,39.200000,49.5

In [9]:
adult.groupby([adult["native-country"] =='Japan','Salary_range'])['hours-per-week'].mean()

native-country  Salary_range
False            <=50K          38.840210
                 >50K           45.473026
Name: hours-per-week, dtype: float64